Repository: nacyot/omegat-emacs.sexy
Catalog: omegat-emacs.sexy-level2.tmx
Source language: en
Languages: ko

source: (and awesome).
ko: (물론 기능도 뛰어나고요).

source: Planet Emacsen — An Emacs planet collecting posts from many Emacs blogs.
ko: 이맥시안 플래닛(Planet Emacsen) — 이맥스와 관련된 블로그들의 기사를 수집하는 사이트

source: /r/emacs — Reddit is a virtual community of (generally) very nice people.
ko: /r/emacs — 레딧은 다양한 사람들이 모여있는 가상 커뮤니티입니다.

source: Emacs Movies — Tutorial screencasts for Emacs.
ko: 이맥스 무비(Emacs Movies) — 이맥스 튜토리얼 스크린캐스트

source: Emacs Rocks — a series of videos teaching about Emacs.
ko: Emacs Rocks — 이맥스의 다양한 기능을 보여주는 튜토리얼 비디오.

source: Emacs Wiki — a collection of useful information regarding Emacs and Emacs Lisp, its extension language.
ko: 이맥스위키(Eamcs Wiki) — 이맥스와 이맥스 리스프(Lisp)에 관련된 유용한 정보가 정리된 위키

source: Mastering Emacs — A blog about mastering the world's best text editor.
ko: 이맥스 마스터하기(Mastering Emacs) — 세계 최강 텍스트 에디터의 수련법을 다루는 블로그

source: More info on Emacs for Windows on the GNU website.
ko: 윈도우 이맥스에 대한 더 자세한 정보는 GNU 사이트를 참조해주세요.

source: The Emacs Manual — Official GNU Emacs manual.
ko: 이맥스 매뉴얼(The Emacs Manual) — 공식 GNU 이맥스 매뉴얼.

source: What the .emacs.d!? — Blog from the same author as Emacs Rocks, about setting up your .emacs.d.
ko: What the .emacs.d!? — Emacs Rocks 제작자의 .emacs.d 설정을 다루는 블로그

source: Org mode helps you keeping notes, maintaining TODO lists, planing projects and authoring documents.
ko: Org mode는 여러 기록을 비롯해 TODO 리스트 정리, 프로젝트 관리, 문서 관리를 도와줍니다.

source: ERC is a built-in IRC client and BitlBee can be used as a gateway for several IM services.
ko: ERC는 빌트인 이맥스 IRC 클라이언트이며, BitlBee는 몇몇 메신저 서비스를 이맥스 안에서 사용할 수 있게해줍니다.

source: Tramp allows you to edit remote files without leaving Emacs.
ko: Tramp는 이맥스에서 네트워크 상의 파일을 편집할 수 있게 도와줍니다.

source: Guido van Rossum created the Python programming language.
ko: 귀도 반 로썸(Guido van Rossum). 파이썬 프로그래밍 언어를 만든 프로그래머.

source: Instead of using your mouse, you can press Alt + X on your keyboard, which will take you to the command mode on the lower screen of Emacs.
ko: 마우스 대신에 Alt + X 키를 눌러 이맥스 화면 아래 쪽의 명령어 버퍼에서 명령어를 입력할 수도 있습니다.

source: Jim Weirich was a well known rubyist, creator of Rake (Ruby make) among other tools.
ko: Jim Weirich. 루비스트로 유명하며 Rake(루비의 make)와 다른 툴들을 만든 프로그래머.

source: Julian Assange founder of WikiLeaks.
ko: 줄리언 어산지(Julian Assange) 위키 리크스(WikiLeaks) 설립자.

source: Linus Torvalds creator of Linux and Git uses uEmacs, a MicroEmacs.
ko: 리누스 토발즈(Linus Torvalds). 리눅스와 깃의 아버지. uEmacs라는 마이크로 이맥스를 사용합니다.

source: Richard Stallman creator of GNU Emacs, founder of the Free Software Movement.
ko: 리처드 스톨만(Richard Stallman). GNU 이맥스를 만들었고 자유소프트 운동을 주도한 프로그래머.

source: Yukihiro Matsumoto (Matz) created the Ruby programming language.
ko: 유키히로 마츠모토 (Matz). 루비 프로그래밍 언어를 만든 프로그래머.

source: A great resource for starters is this visual guide to learning Emacs by Sacha Chua under a CC by license: How to Learn Emacs: A Hand-drawn One-pager for Beginners: You can also check out these other visual guides:
ko: Sacha Chua는 이맥스를 배우기 위한 비주얼 가이드를 CC 라이센스로 공개하고 있습니다. 이맥스 배우기 : 손으로 그린 입문자를 위한 한 페이지 가이드(How to Learn Emacs: A Hand-drawn One-pager for Beginner). 다른 비주얼 가이드도 공개되어있습니다.

source: Colorful text editor
ko: 화려한 텍스트 에디터

source: Download Emacs
ko: 이맥스 다운로드

source: Download Emacs for Mac OS X.
ko: Mac OS X 이맥스를 다운로드 받아주세요.

source: Emacs
ko: 이맥스

source: Emacs Subreddit
ko: 이맥스 서브 레딧

source: Emacs for Mac OS X
ko: Mac OS X 이맥스

source: Emacs Mac Por
ko: Emacs Mac Port

source: Emacs Mac Port.
ko: 이맥스 맥 포트(Emacs Mac Port)

source: Emacs Movies
ko: 이맥스 무비

source: Emacs Rocks
ko: 이맥스 락(Emacs Rocks)

source: Emacs can be adapted in every possible way, including its looks.
ko: 이맥스는 어느 부분이건 원하는대로 커스터마이징 가능하며 테마 기능 또한 지원합니다.

source: Emacs for Mac OS
ko: Mac OS 이맥스

source: Emacs includes a great tutorial to teach you how to use Emacs while you're using Emacs.
ko: 이맥스에는 이맥스 위에서 실행할 수 있는 훌륭한 튜토리얼이 내장되어 있습니다.

source: Emacs is a text editor which you can customize and extend in so many ways.
ko: 이맥스는 다양한 확장 기능을 지원하고 원하는대로 커스터마이징 가능한 텍스트 에디터입니다.

source: Emacs is included in Mac OS X, so you can just use Terminal.app, type emacs and you're ready to roll.
ko: 이맥스는 Mac OS X에 기본적으로 포함되어있습니다. Terminal.app을 실행시키고 emacs 명령어를 실행시켜주세요.

source: Emacs is used by lots of happy users around the globe.
ko: 이맥스는 전세계의 많은 사람들이 행복하게 사용하고 있습니다.

source: Emacs is used by very happy hackers all around the globe.
ko: 이맥스는 전 세계의 해커들이 행복하게 사용하고 있습니다.

source: Emacs on Tron Legacy
ko: Tron Legacy에 등장하는 이맥스

source: Emacs package archives
ko: 이맥스 패키지 아카이브

source: EmacsWiki
ko: 이맥스위키(EmacsWiki)

source: Et tu, Programmer?
ko: Et tu, Programmer?(프로그래머이신가요?)

source: Famous Emacs Users
ko: 유명한 이맥스 사용자들

source: From there you can click on the Emacs Tutorial link with your mouse.
ko: 페이지에서 마우스로 Emacs Tutorial 링크를 클릭합니다.

source: GNU Emacs is Free Software, free as in free beer and free as in free speech.
ko: GNU Emacs는 돈을 지불할 필요도 없으며 어떠한 제약도 없는 자유 소프트웨어입니다.

source: GNU Emacs is available on most GNU/Linux distributions.
ko: GNU 이맥스는 거의 모든 GNU/Linux 배포판에서 사용 가능합니다.

source: Get used to it, because there's more where that came from.
ko: 이런 방식의 명령어 실행은 자주 사용되므로 친숙해지시길 바랍니다.

source: How to Learn Emacs
ko: 이맥스 배우는 방법

source: How to learn Emacs keyboard shortcuts
ko: 이맥스 단축키 익히기

source: How to learn Emacs keyboard shortcuts (a visual tutorial for newbies)
ko: 이맥스 단축키 익히기(입문자를 위한 시각적 튜토리얼)

source: If it's not, you can use your system's package manager (apt, yum, pacman, etc.) or download Emacs from the GNU site.
ko: emacs 명령어를 찾을 수 없다면 apt, yum, pacman과 같은 시스템 패키지 매니저를 사용해 설치할 수 있습니다. GNU 사이트에서 직접 이맥스를 다운로드 받는 방법도 있습니다.

source: Install Emacs
ko: 이맥스 설치하기

source: Install using Homebrew.
ko: Homebrew를 사용해 설치하세요.

source: Installing Emacs
ko: 이맥스 설치하기

source: It was written in C and provides its own implementation of Lisp, the language from which the Gods wrought the universe.
ko: 이맥스는 C 언어로 만들어진 프로그램으로, 이맥스 확장을 위한 독자적인 Lisp 구현(Elisp)을 포함하고 있습니다.

source: It's a very old version though, and it's recommended that you use the latest stable version which is Emacs 24.
ko: 하지만 이는 오래된 버전일 가능성이 높습니다. 최신 안정 버전인 이맥스 24 사용을 권장합니다.

source: It's a very powerful text processor, allowing you to manipulate blocks of text, paragraphs, words, finding, replacing, using regular expressions, keyboard macros and more.
ko: 이맥스에서는 블럭, 문단, 단어, 검색, 치환, 정규표현식과 다양한 키보드 매크로를 지원하는 매우 강력한 텍스트 에디터입니다.

source: It's available out of the box on some of them.
ko: 몇몇 시스템에서는 emacs 명령어를 실행하는 것만으로 바로 사용할 수 있습니다.

source: It's dangerous to go alone; take this:
ko: 혼자서 씨름하지 마세요. 아래의 자료들이 도움을 줄 것입니다.

source: It's just the tip of the iceberg, and your quest has just begun.
ko: 튜토리얼은 빙산의 일각에 불과합니다. 이제부터가 정말 시작입니다.

source: Learn Emacs
ko: 이맥스 배우기

source: Lisp, Ruby, Python, PHP, Java, Erlang, JavaScript, C, C++, Prolog, Tcl, AWK, PostScript, Clojure, Scala, Perl, Haskell, Elixir all of these languages and more are supported in Emacs.
ko: 리스프, 루비, 파이썬, PHP, 자바, 얼랭, 자바스크립트, C, C++, 프롤로그, Tcl, AWK, 포스트스크립트, 클로저, 스칼라, 펄, 하스켈, Elixir 등등 열거한 언어는 물론 이 외에도 다양한 언어를 지원하고 있습니다.

source: Lots of them are willing to help you get started or share the path they've walked along Emacs with you.
ko: 이들은 이맥스를 시작하려는 여러분에게 기꺼이 도움이 되어줄 것이며 자신들의 경험을 공유해줄 것입니다.

source: Mastering Emacs
ko: 이맥스 마스터하기

source: Mastering Emacs is not the goal, it's the path.
ko: 이맥스를 정복하는 일은 목표가 아니라 과정이다.

source: Mind blown?
ko: 놀라셨나요?

source: More info here.
ko: 더 자세한 정보는 이맥스 위키를 참조해주세요.

source: More!
ko: 이외에도 다양한 기능들을 지원합니다!

source: Not only does it give the user the four essential freedoms, its architecture is built in such a way that you have the power to mold it, change it and make it comply to your computering needs.
ko: 이맥스는 사용자에게 4가지 본질적 자유를 선사합니다. 이 뿐만 아니라 이맥스는 변화와 확장에 적합하게 설계되어있습니다.

source: Once you've installed Emacs, start it up.
ko: 이맥스를 설치하고 실행해주세요.

source: Planet Emacsen
ko: 이맥시안 플래닛(Planet Emacsen)

source: Resources
ko: 참고 자료

source: See more manuals here.
ko: 더 많은 매뉴얼을 찾는다면 여기에 방문해주세요.

source: Some "famous" Emacs users are:
ko: 아래는 그 중에서 유명한 사람들입니다.

source: Some tips for learning Org Mode for Emacs
ko: 이맥스 Org 모드 학습을 위한 팁(Some tips for learing Org Mode for Emacs)

source: The Emacs Manual
ko: 이맥스 매뉴얼

source: The officially supported systems are GNU, GNU/Linux, FreeBSD, NetBSD, OpenBSD, Mac OS X, MS Windows and Solaris.
ko: 공식적으로 GNU, GNU/Linux, FreeBSD, NetBSD, OpenBSD, Mac OS X, MS Windows, Solaris를 지원합니다.

source: The original Emacs was written by St. iGNUcius himself — Richard Stallman.
ko: 이맥스는 St. iGNUcius — 리처드 스톨만이 처음 만들었습니다.

source: Then write help-with-tutorial and press Enter.
ko: help-with-tutorial라고 입력해주세요.

source: There are more than 2,000 packages for Emacs.
ko: 이맥스 패키지 아카이브에는 2000개 이상의 패키지가 있습니다.

source: There are tools for probably every programming language out there.
ko: 이맥스는 거의 모든 프로그래밍 언어를 지원합니다.

source: There are various ways to install the latest Emacs on Mac OS X:
ko: Mac OS X에서는 다양한 방법으로 이맥스를 설치할 수 있습니다.

source: There's a reason why Emacs was featured in Tron Legacy, it is sexy!
ko: Tron Legacy에 이맥스가 등장한 데는 다 이유가 있습니다. 섹시하니까요!

source: This interactive tutorial will teach you the basics on how to move around and edit text.
ko: 이 인터렉티브 튜토리얼은 이맥스에서 커서를 어떻게 이동시키고 텍스트를 어떻게 편집하는지 알려줍니다.

source: This is a work in progress, please help me improve it by forking it on GitHub.
ko: 이 페이지는 작성중입니다. 문서를 개선하고자 하는 분은 Github에서 저장소를 포크해주세요!

source: This is just the beginning.
ko: 이건 시작에 불과합니다.

source: Website created by picandocodigo.
ko: 이 페이지는 picandocodigo에 의해서 제작되었으며 nacyot에 의해 한국어로 번역되었습니다.

source: Why Emacs?
ko: 왜 이맥스인가?

source: Why using Emacs?
ko: 왜 이맥스인가?

source: Windows
ko: 윈도우

source: You can strip it, choose between several themes with M-x load-theme, download one from another happy Emacs user or create your own.
ko: 이맥스의 외관을 벗겨낼 수 있을 뿐 아니라 M-x load-theme 명령어로 다른 사람이 만든 테마를 사용할 수도 있습니다.

source: You can also use mail client, web browser, calendar, games, even edit video and images inside Emacs.
ko: 이맥스 안에서 메일 클라이언트, 웹 브라우저, 캘린더, 게임을 할 수 있고, 심지어 비디오나 이미지를 편집할 수도 있습니다.

source: You can create an account there and share your questions, progress and snippets about Emacs on the Emacs subreddit.
ko: 이맥스 서브 레딧에서 이맥스 대한 정보들을 공유할 수 있습니다.

source: You can download Emacs for Windows from the GNU servers.
ko: 윈도우 용 이맥스는 GNU 서버에서 내려받을 수 있습니다.

source: You can edit files via SSH and edit local files with su/sudo, among other things.
ko: SSH를 통해서 파일을 편집할 수 있게 해주며, 로컬 파일에 대해서도 su/sudo를 사용해 편집할 수 있게 합니다.

source: You can even create HTML websites like this one or export to your documents as LaTeX, Beamer, OpenDocuments and many more formats.
ko: 이 사이트와 같은 HTML로 이루어진 웹사이트도 만들 수 있고, 작성한 문서를 LaTeX, Beamer, OpenDocument 등 다양한 포맷으로 변환할 수 있습니다.

source: You can install Emacs on almost every operating system out there.
ko: 이맥스는 대부분의 운영체제를 지원하고 있습니다.

source: You can install more packages with M-x list-packages from GNU ELPA, MELPA and Marmelade.
ko: M-x list-packages 명령어를 사용하면 GNU ELPA, MELPA, Marmelade에서 사용하고자하는 패키지를 검색하고 설치할 수 있습니다.

source: You can use Emacs for all of your text processing needs, internet and social network interactions, hacking, coding, managing to-do's and organizing your daily schedule, play Tetris and it can even provide you with free psychotherapy and counseling using M-x doctor.
ko: 이맥스는 단순한 텍스트 에디터 기능 뿐만 아니라 소셜 네트워크, 해킹, 코딩, TODO 리스트 관리, 일정 관리, 테트리스도 가능하며, 심지어는 심리치료와 카운셀링을 위해 M-x doctor 기능도 지원하고 있습니다.

source: You get syntax highlighting, automatic indentation, running code inside the editor, debugging, code browsing, version control systems integration and much more.
ko: 각각의 언어에 대해서 문법 강조(Syntax highlighting), 자동 들여쓰기, 에디터 안에서 코드 실행하기, 디버깅, 코드 탐색, 버전 컨트롤 시스템을 사용할 수 있습니다.

source: You just entered the first of many Emacs commands.
ko: 수많은 이맥스 명령어 중에 하나를 처음으로 실행했습니다.

source: You know the warm fuzzies you just got?
ko: 어떻게 느껴지시나요?

source: You will be greeted with a welcome screen.
ko: 이맥스가 여러분을 반겨줍니다.

source: get Emacs for Windows
ko: 윈도우 이맥스 다운로드

source: — A happy Emacs user
ko: — 어느 행복한 이맥스 사용자
